# Chapter 6

# Data Loading, Storage, and File Formats

## 6.1: Reading and Writing Data in Text Format

In [48]:
import pandas as pd
import numpy as np

In [1]:
!cat examples/ex1.csv

a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [4]:
df = pd.read_csv('examples/ex1.csv')

In [5]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [8]:
!cat examples/ex2.csv

1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

#### Assign default column names

In [7]:
pd.read_csv('examples/ex2.csv', header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

#### Specifiy column names

In [9]:
pd.read_csv('examples/ex2.csv', names=['a', 'b', 'c', 'd', 'message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [10]:
names = ['a', 'b', 'c', 'd', 'message']

In [11]:
pd.read_csv('examples/ex2.csv', names=names, index_col='message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [12]:
!cat examples/csv_mindex.csv

key1,key2,value1,value2
one,a,1,2
one,b,3,4
one,c,5,6
one,d,7,8
two,a,9,10
two,b,11,12
two,c,13,14
two,d,15,16

In [13]:
parsed = pd.read_csv('examples/csv_mindex.csv',
                    index_col=['key1', 'key2'])

In [14]:
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [16]:
list(open('examples/ex3.txt'))

['            A         B         C\n',
 'aaa -0.264438 -1.026059 -0.619500\n',
 'bbb  0.927272  0.302904 -0.032399\n',
 'ccc -0.264273 -0.386314 -0.217601\n',
 'ddd -0.871858 -0.348382  1.100491\n']

In [17]:
result = pd.read_csv('examples/ex3.txt', sep='\s+')

In [18]:
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [19]:
!cat examples/ex4.csv

# hey!
a,b,c,d,message
# just wanted to make things more difficult for you
# who reads CSV files with computers, anyway?
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [20]:
pd.read_csv('examples/ex4.csv', skiprows=[0, 2, 3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [21]:
!cat examples/ex5.csv

something,a,b,c,d,message
one,1,2,3,4,NA
two,5,6,,8,world
three,9,10,11,12,foo

In [22]:
result = pd.read_csv('examples/ex5.csv')

In [23]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [24]:
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [25]:
result = pd.read_csv('examples/ex5.csv', na_values=['NULL'])

In [26]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [27]:
sentinels = {'message': ['foo', 'NA'], 'something': ['two']}

In [28]:
pd.read_csv('examples/ex5.csv', na_values=sentinels)

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

### Reading Text Files in Pieces

In [29]:
pd.options.display.max_rows = 10

In [30]:
result = pd.read_csv('examples/ex6.csv')

In [31]:
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [32]:
pd.read_csv('examples/ex6.csv', nrows=5)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [33]:
chunker = pd.read_csv('examples/ex6.csv', chunksize=1000)

In [34]:
chunker

In [35]:
chunker = pd.read_csv('examples/ex6.csv', chunksize=1000)

tot = pd.Series([])
for piece in chunker:
    tot = tot.add(piece['key'].value_counts(), fill_value=0)
    
tot = tot.sort_values(ascending=False)

<ipython-input-35-dd0c6c3a4562>:3: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  tot = pd.Series([])

In [36]:
tot[:10]

E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
M    338.0
J    337.0
F    335.0
K    334.0
H    330.0
dtype: float64

### Writing Data to Text Format

In [37]:
data = pd.read_csv('examples/ex5.csv')

In [38]:
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [39]:
data.to_csv('examples/out.csv')

In [40]:
!cat examples/out.csv

,something,a,b,c,d,message
0,one,1,2,3.0,4,
1,two,5,6,,8,world
2,three,9,10,11.0,12,foo

In [41]:
import sys

In [42]:
data.to_csv(sys.stdout, sep='|')

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [43]:
data.to_csv(sys.stdout, na_rep='NULL')

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

In [44]:
data.to_csv(sys.stdout, index=False, header=False)

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

In [45]:
data.to_csv(sys.stdout, index=False, columns=['a', 'b', 'c'])

a,b,c
1,2,3.0
5,6,
9,10,11.0

In [46]:
dates = pd.date_range('1/1/2000', periods=7)

In [49]:
ts = pd.Series(np.arange(7), index=dates)

In [50]:
ts.to_csv('examples/tseries.csv')

In [51]:
!cat examples/tseries.csv

,0
2000-01-01,0
2000-01-02,1
2000-01-03,2
2000-01-04,3
2000-01-05,4
2000-01-06,5
2000-01-07,6

### Working with Delimited Formats

In [52]:
!cat examples/ex7.csv

"a","b","c"
"1","2","3"
"1","2","3"

In [53]:
import csv
f = open('examples/ex7.csv')

reader = csv.reader(f)

In [54]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [55]:
with open('examples/ex7.csv') as f:
    lines = list(csv.reader(f))

In [56]:
header, values = lines[0], lines[1:]

In [57]:
data_dict = {h: v for h, v in zip(header, zip(*values))}

In [58]:
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

In [61]:
class my_dialect(csv.Dialect):
    lineterminator = '\n'
    delimiter = ';'
    quotechar = '"'
    quoting = csv.QUOTE_MINIMAL

In [62]:
with open('mydata.csv', 'w') as f:
    writer = csv.writer(f, dialect=my_dialect)
    writer.writerow(('one', 'two', 'three'))
    writer.writerow(('1', '2', '3'))
    writer.writerow(('4', '5', '6'))
    writer.writerow(('7', '8', '9'))

### JSON Data

In [66]:
obj = """
{"name": "Wes",
"places_lived": ["United States", "Spain", "Germany"],
"pet": null,
"siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
            {"name": "Katie", "age": 38, "pets": ["Sixes", "Stache", "Cisco"]}]

}
"""

In [64]:
import json

In [67]:
result = json.loads(obj)

In [68]:
result

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [69]:
asjson = json.dumps(result)

In [70]:
siblings = pd.DataFrame(result['siblings'], columns=['name', 'age'])

In [71]:
siblings

    name  age
0  Scott   30
1  Katie   38

In [72]:
!cat examples/example.json

[{"a": 1, "b": 2, "c": 3},
 {"a": 4, "b": 5, "c": 6},
 {"a": 7, "b": 8, "c": 9}]

In [73]:
data = pd.read_json('examples/example.json')

In [74]:
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [75]:
print(data.to_json())

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}

In [76]:
print(data.to_json(orient='records'))

[{"a":1,"b":2,"c":3},{"a":4,"b":5,"c":6},{"a":7,"b":8,"c":9}]

### XML and HTML: Web Scraping

In [77]:
%conda install lxml

Collecting package metadata (current_repodata.json): done
Solving environment: done

## Package Plan ##

  environment location: /Users/derek/opt/anaconda3

  added / updated specs:
    - lxml


The following packages will be downloaded:

    package                    |            build
    ---------------------------|-----------------
    conda-4.9.2                |   py38hecd8cb5_0         2.9 MB
    ------------------------------------------------------------
                                           Total:         2.9 MB

The following packages will be UPDATED:

  conda                                        4.8.3-py38_0 --> 4.9.2-py38hecd8cb5_0



Downloading and Extracting Packages
conda-4.9.2          | 2.9 MB    | ##################################### | 100%
Preparing transaction: done
Verifying transaction: done
Executing transaction: done

Note: you may need to restart the kernel to use updated packages.

In [79]:
%conda install beautifulsoup4 html5lib

Collecting package metadata (current_repodata.json): done
Solving environment: done

# All requested packages already installed.


Note: you may need to restart the kernel to use updated packages.

In [80]:
tables = pd.read_html('examples/fdic_failed_bank_list.html')

In [81]:
len(tables)

1

In [82]:
failures = tables[0]

In [83]:
failures.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"

In [84]:
close_timestamps = pd.to_datetime(failures['Closing Date'])

In [85]:
close_timestamps.dt.year.value_counts()

2010    157
2009    140
2011     92
2012     51
2008     25
       ...
2004      4
2001      4
2007      3
2003      3
2000      2
Name: Closing Date, Length: 15, dtype: int64

#### Parsing XML with lxml.objectify

In [86]:
from lxml import objectify

In [87]:
path = 'datasets/mta_perf/Performance_MNR.xml'
parsed = objectify.parse(open(path))
root = parsed.getroot()

FileNotFoundError: [Errno 2] No such file or directory: 'datasets/mta_perf/Performance_MNR.xml'

## 6.2: Binary Data Formats

In [88]:
frame = pd.read_csv('examples/ex1.csv')

In [89]:
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [90]:
frame.to_pickle('examples/frame_pickle')

In [91]:
pd.read_pickle('examples/frame_pickle')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

### Using HDF5 Format

In [92]:
frame = pd.DataFrame({'a': np.random.randn(100)})

In [94]:
store = pd.HDFStore('mydata.h5')

In [95]:
store['obj1'] = frame

In [96]:
store['obj1_col'] = frame['a']

In [97]:
store

<class 'pandas.io.pytables.HDFStore'>
File path: mydata.h5

In [98]:
store['obj1']

           a
0   1.395313
1   0.792570
2   1.065529
3   0.702001
4   0.270335
..       ...
95  0.779175
96 -0.078016
97  0.657254
98  0.938381
99  3.022040

[100 rows x 1 columns]

In [99]:
store.put('obj2', frame, format='table')

In [100]:
store.select('obj2', where=['index >= 10 and index <= 15'])

           a
10 -0.236723
11 -0.912908
12  0.985030
13 -1.281897
14 -0.090936
15  3.113221

In [101]:
frame.to_hdf('mydata.h5', 'obj3', format='table')

### Reading Microsoft Excel Files

In [103]:
xlsx = pd.ExcelFile('examples/ex1.xlsx')

In [104]:
pd.read_excel(xlsx, 'Sheet1')

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [105]:
frame = pd.read_excel('examples/ex1.xlsx', 'Sheet1')

In [106]:
frame

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [107]:
writer = pd.ExcelWriter('examples/ex2.xlsx')

In [108]:
frame.to_excel(writer, 'Sheet1')

In [109]:
writer.save()

In [110]:
frame.to_excel('examples/ex2.xlsx')

## 6.3: Interacting with Web APIs

In [111]:
import requests

In [112]:
url = 'https://api.github.com/repos/pandas-dev/pandas/issues'

In [113]:
resp = requests.get(url)

In [114]:
resp

In [115]:
data = resp.json()

In [116]:
data[0]['title']

'REF: IntervalIndex.intersection match pattern in other intersection methods'

In [117]:
issues = pd.DataFrame(data, columns=['number', 'title', 'labels', 'state'])

In [118]:
issues

,number,title,labels,state
0,38190,REF: IntervalIndex.intersection match pattern ...,[],open
1,38189,DOC: fix redirects to user guide in README,[],open
2,38188,Rewrite dict literal for files in tests/plotti...,[],open
3,38187,"BUG: groupby.rank for dt64tz, period dtypes",[],open
4,38186,Rewrite dict literal for files in tests/plotti...,[],open
...,...,...,...,...
25,38154,CLN: improve is_unique check in Index.intersec...,"[{'id': 211029535, 'node_id': 'MDU6TGFiZWwyMTE...",open
26,38153,BUG: loc raising KeyError for string slices in...,"[{'id': 2822098, 'node_id': 'MDU6TGFiZWwyODIyM...",open
27,38150,BUG: loc dropping levels when df has only one row,"[{'id': 2822098, 'node_id': 'MDU6TGFiZWwyODIyM...",open
28,38149,ASV: add benchmark for concat / append of cast...,"[{'id': 732775912, 'node_id': 'MDU6TGFiZWw3MzI...",open
29,38147,BUG: reset_index() Fails on a Series/DataFrame...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open

## 6.4: Interacting with Databases

In [119]:
import sqlite3

In [120]:
query = """
CREATE TABLE test
(a VARCHAR(20), b VARCHAR(20),
c REAL,         d INTEGER);
"""

In [121]:
con = sqlite3.connect('mydata.sqlite')

In [122]:
con.execute(query)

In [123]:
con.commit()

In [124]:
data = [('Atlanta', 'Georgia', 1.25, 6),
       ('Tallahassee', 'Florida', 2.6, 3),
       ('Sacramento', 'California', 1.7, 5)]

In [125]:
stmt = 'INSERT INTO test VALUES(?, ?, ?, ?)'

In [126]:
con.executemany(stmt, data)

In [127]:
con.commit()

In [128]:
cursor = con.execute('select * from test')

In [129]:
rows = cursor.fetchall()

In [130]:
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [131]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [132]:
pd.DataFrame(rows, columns=[x[0] for x in cursor.description])

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

In [133]:
import sqlalchemy as sqla

In [134]:
db = sqla.create_engine('sqlite:///mydata.sqlite')

In [135]:
pd.read_sql('select * from test', db)

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5